{"slug":"htc-nmtc-master-lease-structures-how-they-work","metadata":{"title":"HTC/NMTC Master Lease Structures: How They Work and Why They Matter","publishedAt":"2025-03-05","summary":"A practitioner-friendly breakdown of the HTC/NMTC master lease structure and why it remains the go-to model for twinned deals.","image":"/images/Tax Credit Images/nmtc-structure-htc-passthrough-l.jpg","author":"tCredex Team","authorImg":"/images/post-author-02.jpg","authorRole":"Editorial","category":"Strategies"},"content":"Combining Historic Tax Credits (HTC) and New Markets Tax Credits (NMTC) can unlock transformative redevelopment projects — but the structure is complex. The HTC/NMTC master lease model is the most widely used approach for twinned deals.\r\n\r\n## Why use a master lease structure?\r\n\r\nThe master lease structure allows:\r\n\r\n- HTC investors to claim credits through a lessee entity\r\n- NMTC investors to participate through a leverage structure\r\n- Separation of ownership and operations\r\n- Flexibility in allocating QREs and QLICI proceeds\r\n\r\nIt's a structure born from necessity — aligning two programs with different rules, timelines, and compliance frameworks.\r\n\r\n## Core components\r\n\r\n### 1. Property owner (fee owner)\r\n\r\nHolds title to the historic building and performs the rehabilitation.\r\n\r\n### 2. Master tenant (lessee)\r\n\r\nLeases the property from the owner and claims the HTC, subject to program rules and ownership tests.\r\n\r\n### 3. NMTC structure\r\n\r\nTypically includes:\r\n\r\n- A **leverage lender** providing debt into the NMTC investment fund\r\n- An **investment fund** receiving equity from the NMTC investor\r\n- One or more **CDEs** making QLICIs\r\n- A **QALICB**, often the master tenant or a related entity\r\n\r\n### 4. QRE allocation\r\n\r\nQualified Rehabilitation Expenditures must be properly allocated to the master tenant so that entity can validly claim the HTC.\r\n\r\n### 5. Compliance periods\r\n\r\n- HTC: 5-year recapture period\r\n- NMTC: 7-year compliance period\r\n\r\nThe structure must survive both without tripping recapture.\r\n\r\n## Common challenges\r\n\r\n- Aligning QRE timing with NMTC disbursements and placed-in-service dates\r\n- Managing related-party rules between owner, master tenant, and QALICB\r\n- Ensuring the master tenant is a valid HTC claimant\r\n- Coordinating exit strategies that work for both HTC and NMTC investors\r\n\r\n## How tCredex helps\r\n\r\ntCredex simplifies HTC/NMTC master lease deals by:\r\n\r\n- **Providing pre-built structure templates** and entity diagrams\r\n- **Automating QRE/QALICB alignment** and tracking\r\n- **Generating documentation** tailored to both credit programs\r\n- **Tracking compliance** across overlapping 5- and 7-year periods\r\n\r\nMaster lease structures are complex — but with the right tools, they become manageable, teachable, and repeatable."}