{"slug":"qalicb-qualification-technical-rules-nmtc-practitioners","metadata":{"title":"QALICB Qualification: The Technical Rules Every NMTC Practitioner Must Master","publishedAt":"2025-03-27","summary":"A deep technical explainer on the QALICB tests, common pitfalls, and how to operationalize compliance monitoring.","image":"/images/Tax Credit Images/NMTCmodel.jpg","author":"tCredex Team","authorImg":"/images/post-author-02.jpg","authorRole":"Editorial","category":"NMTC"},"content":"The Qualified Active Low-Income Community Business (QALICB) test is the backbone of NMTC compliance. If the operating entity fails this test, the entire structure is at risk.\r\n\r\n## The five core tests\r\n\r\n### 1. Gross income test\r\n\r\nAt least 50% of gross income must be derived from activities in a Low-Income Community (LIC).\r\n\r\n### 2. Tangible property test\r\n\r\nAt least 40% of the tangible property must be located in an LIC.\r\n\r\n### 3. Services performed test\r\n\r\nAt least 40% of services must be performed in an LIC, often measured by payroll or hours.\r\n\r\n### 4. Collectibles restriction\r\n\r\nNo more than 5% of property can be collectibles, such as art or similar assets.\r\n\r\n### 5. Nonqualified financial property (NQFP)\r\n\r\nNo more than 5% of assets can be NQFP, such as certain financial instruments and excess cash.\r\n\r\n## Common pitfalls\r\n\r\n- Misclassifying revenue sources between LIC and non-LIC activities\r\n- Incorrectly allocating property across locations or facilities\r\n- Failing to track service hours or payroll by geography\r\n- Holding excess cash or financial instruments beyond allowed limits\r\n\r\n## Why QALICB qualification is hard\r\n\r\n- Multi-entity ownership and operating structures\r\n- Businesses with multiple locations, some in and some out of LICs\r\n- Construction and start-up periods where revenue is limited or evolving\r\n- Blended NMTC + HTC or OZ deals where multiple regimes interact\r\n\r\n## How tCredex helps\r\n\r\ntCredex supports QALICB compliance by:\r\n\r\n- **Automating QALICB testing** against the five core standards\r\n- **Providing real-time compliance alerts** as project data changes\r\n- **Standardizing data collection** from borrowers and operators\r\n- **Embedding practitioner-built logic** into workflows and dashboards\r\n\r\nQALICB qualification is technical — but with the right infrastructure, it becomes predictable instead of mysterious."}