{"slug":"tcredex-five-tax-credit-platform","metadata":{"title":"tCredex.com: The First Platform Built for All Five Major Tax-Credit Programs","publishedAt":"2025-03-12","summary":"Why the tax-credit industry needs shared infrastructure and how tCredex unifies LIHTC, NMTC, HTC, OZ, and state credits.","image":"/images/Tax Credit Images/The Data Driven Developer.jpg","author":"tCredex Team","authorImg":"/images/post-author-01.jpg","authorRole":"Platform","category":"Platform"},"content":"The tax-credit industry has long operated in silos. LIHTC teams use one set of tools. NMTC teams use another. HTC, OZ, and state credit practitioners rely on spreadsheets, PDFs, and institutional memory.\n\ntCredex changes that.\n\n## The five programs tCredex supports\n\n### 1. Low-Income Housing Tax Credits (LIHTC)\n\nStandardized underwriting, eligible basis modeling, and investor documentation to support affordable housing transactions.\n\n### 2. New Markets Tax Credits (NMTC)\n\nGuided leverage structures, compliance workflows, and QALICB validation for community and economic development projects.\n\n### 3. Historic Tax Credits (HTC)\n\nQRE tracking, Part 1–3 documentation support, and twinned structure templates for HTC + NMTC and HTC + LIHTC.\n\n### 4. Opportunity Zones (OZ)\n\nAsset-test tracking, QOZB structuring, and investor reporting for long-term equity in distressed communities.\n\n### 5. State Tax Credits\n\nModeling, compliance, and documentation for state-level programs across the country, including transferability workflows.\n\n## Why a unified platform matters\n\nFor the first time, practitioners can:\n\n- **Build blended capital stacks** without recreating structures from scratch\n- **Standardize documentation** across programs, deals, and teams\n- **Reduce compliance risk** with practitioner-built rules baked into workflows\n- **Accelerate deal timelines** by cutting friction out of closing\n- **Operate from a single source of truth** instead of scattered files and emails\n\n## Built by practitioners, not outsiders\n\ntCredex is informed by decades of experience — including CDE operations, multiple allocation awards, and billions syndicated. The platform encodes what seasoned practitioners already know and brings that discipline to every deal.\n\n## The future of tax-credit finance\n\ntCredex is more than software.  \nIt's the missing infrastructure for a fragmented industry — a shared operating system for tax-credit finance."}