{"slug":"what-is-lihtc-part-1","metadata":{"title":"What Is the Low-Income Housing Tax Credit? (Part 1)","publishedAt":"2025-05-11","summary":"How the nation's most important affordable housing program works—from Congress to residents through the LIHTC system.","image":"/images/Tax Credit Images/What Is the Low-Income Housing Tax Credit.jpg","author":"Charles Sims","authorImg":"/images/author-charles-sims.jpg","authorRole":"Affordable Housing Developer","category":"Housing Finance"},"content":"The Low-Income Housing Tax Credit (LIHTC) represents America's primary federal mechanism for producing affordable rental housing. Established through the Tax Reform Act of 1986, this program has enabled creation of nearly 3.8 million affordable homes nationwide.\r\n\r\n## Core Mechanism\r\n\r\nRather than direct subsidies, LIHTC operates through the tax code, offering federal income tax credits to private investors financing qualified developments. The program costs approximately $13.5 billion annually while leveraging significantly larger private investment totals.\r\n\r\n## How It Works: Five Steps\r\n\r\n### 1. Congress Establishes Rules\r\n\r\nInternal Revenue Code Section 42 defines LIHTC requirements, including income limits, rent restrictions, compliance periods, and credit calculations.\r\n\r\n### 2. State Housing Finance Agencies Administer\r\n\r\nEach state receives credit authority based on population. State HFAs develop Qualified Allocation Plans (QAPs) establishing competitive priorities—location, affordability depth, special needs populations, and development quality.\r\n\r\n### 3. Developers Submit Proposals\r\n\r\nDevelopers apply for credits through competitive or non-competitive processes. Applications demonstrate financial feasibility, community benefit, and alignment with state priorities. The 9% credit requires competitive allocation; the 4% credit pairs with tax-exempt bonds.\r\n\r\n### 4. Investors Purchase Credits\r\n\r\nDevelopers \"sell\" tax credits to investors (typically banks and financial institutions) in exchange for equity. This equity fills the gap between project costs and available debt financing, enabling affordable rent levels.\r\n\r\n### 5. Residents Move In\r\n\r\nQualified households—those earning below area median income thresholds—rent units at restricted rates. Compliance monitoring continues for minimum 15 years, with extended affordability periods often reaching 30+ years.\r\n\r\n## Key Stakeholders\r\n\r\n### Developers\r\n\r\nAccess lower-cost capital for affordable housing through tax credit equity. May be nonprofit mission-driven organizations or for-profit developers specializing in affordable housing.\r\n\r\n### Investors\r\n\r\nReceive tax credits against federal income tax liability over ten years, plus depreciation benefits. Banks pursue LIHTC investments partly for Community Reinvestment Act compliance.\r\n\r\n### Government Agencies\r\n\r\nShape priorities through QAPs, monitor compliance, and ensure public benefit from tax expenditure.\r\n\r\n### Property Managers\r\n\r\nMaintain operational standards, income certification, and unit quality throughout compliance periods.\r\n\r\n### Residents\r\n\r\nHouseholds earning 30-60% of Area Median Income (AMI) access quality housing at affordable rents.\r\n\r\n## Affordability Standards\r\n\r\nUnits remain affordable when tenants pay no more than 30% of income toward rent and utilities. Developers choose income set-asides:\r\n\r\n- **20/50 Test:** 20% of units at 50% AMI or below\r\n- **40/60 Test:** 40% of units at 60% AMI or below\r\n- **Income Averaging:** Flexible targeting averaging 60% AMI across all units\r\n\r\nThese requirements ensure LIHTC properties serve working families, seniors, and households priced out of market-rate housing.\r\n\r\n## Compliance Periods\r\n\r\n**Initial Compliance:** 15 years of IRS monitoring with strict income and rent requirements\r\n\r\n**Extended Use Period:** Most QAPs require 15-30 additional years of affordability\r\n\r\n**Total Affordability:** Often 30+ years, protecting community investment for generations\r\n\r\n## Limitations\r\n\r\nLIHTC alone often cannot serve the lowest-income households (below 30% AMI). The gap between restricted rents and extremely low incomes requires additional subsidy.\r\n\r\nMany projects layer rental assistance like Housing Choice Vouchers (Section 8) to achieve deeper affordability. Without such layering, LIHTC primarily serves households at 50-60% AMI—workforce housing rather than deeply affordable units.\r\n\r\n## Why LIHTC Matters\r\n\r\nDespite complexity, LIHTC has proven remarkably effective:\r\n\r\n- Produced millions of affordable units since 1986\r\n- Maintained low default rates (below 1%)\r\n- Created public-private partnership model\r\n- Generated construction jobs and community investment\r\n- Preserved affordability for decades\r\n\r\nUnderstanding LIHTC is essential for anyone working in affordable housing—from developers to policymakers to community advocates."}