{"slug":"frequently-asked-questions","metadata":{"title":"FAQ – General Topics","updatedAt":"2025-01-19","summary":"Common questions about using tCredex, submitting projects, and navigating the tax credit marketplace.","image":"/images/Tax Credit Images/The Data Driven Developer.jpg"},"content":"## How do I use tCredex without creating an account?\r\n\r\nYou can browse the Marketplace, view public DealCards, and explore program resources without registering.  \r\nTo submit a project, receive matches, or enter the Closing Room, you’ll need to create a free account.\r\n\r\n## Do I need to complete the entire Intake Form before my project goes live?\r\n\r\nNo. Once you reach **Tier 1 (40% completion)** your DealCard becomes visible on the Marketplace.  \r\nYou can continue updating your project at any time.\r\n\r\n## What tax credit programs does tCredex support?\r\n\r\ntCredex currently supports **NMTC, LIHTC, HTC, OZ**, and a growing list of **state-level credits**.  \r\nYour eligible programs appear automatically based on your project’s location and details.\r\n\r\n## How does AutoMatch work?\r\n\r\nAutoMatch analyzes your project profile, census tract, program eligibility, and financing needs to identify compatible **CDEs, investors, and credit buyers**.  \r\nYou’ll receive match notifications as soon as your DealCard is published.\r\n\r\n## Can I update my project after submitting it?\r\n\r\nYes. You can update any section of your Intake Form at any time.  \r\nYour DealCard refreshes automatically, and CDEs see the latest version.\r\n\r\n## What happens if I don’t complete Tier 2 or Tier 3?\r\n\r\nYour project still appears on the Marketplace at Tier 1.  \r\nHigher tiers simply unlock:\r\n\r\n- Tier 2: Full Project Profile + CDE Matching\r\n- Tier 3: Due Diligence Ready + Priority Matching\r\n\r\nYou can progress through tiers whenever you’re ready.\r\n\r\n## What payment methods does tCredex accept?\r\n\r\ntCredex currently supports standard online payment methods for premium features, including major credit cards.  \r\nMost Marketplace features — including project submission and matching — are free."}