{"slug":"payments-faqs","metadata":{"title":"Pricing & Payments","updatedAt":"2025-01-19","summary":"Answers to common questions about tCredex pricing, billing, and payment options.","image":"/images/Tax Credit Images/The Data Driven Developer.jpg"},"content":"## Is tCredex free to use?\r\n\r\nYes. Submitting a project, generating a DealCard, and receiving AutoMatch recommendations are all free.  \r\nPremium features may be introduced in the future, but the core Marketplace remains free for developers and nonprofits.\r\n\r\n---\r\n\r\n## What do I pay for on tCredex?\r\n\r\nMost users never pay anything.  \r\nOptional paid features may include:\r\n\r\n- Enhanced project visibility\r\n- Advanced analytics\r\n- Priority matching\r\n- Additional Closing Room tools\r\n\r\nIf a feature requires payment, it will be clearly labeled before you activate it.\r\n\r\n---\r\n\r\n## What payment methods does tCredex accept?\r\n\r\ntCredex supports major credit cards and standard online payment methods.  \r\nAdditional payment options may be added as the platform expands.\r\n\r\n---\r\n\r\n## Do I need to enter payment information to submit a project?\r\n\r\nNo. You can submit projects, reach Tier 1, and appear on the Marketplace without entering any payment information.\r\n\r\n---\r\n\r\n## Can I upgrade or downgrade my plan later?\r\n\r\nYes. If you choose a paid plan in the future, you’ll be able to switch tiers at any time.  \r\nChanges take effect immediately, and your billing adjusts automatically.\r\n\r\n---\r\n\r\n## Can I cancel a paid plan?\r\n\r\nYes. You can cancel at any time.  \r\nYour plan remains active through the end of the billing cycle, and you won’t be charged again.\r\n\r\n---\r\n\r\n## Do you offer refunds?\r\n\r\nRefunds may be available for accidental charges or technical issues.  \r\nFor help, contact **support@tcredex.com**.\r\n\r\n---\r\n\r\n## Will pricing change in the future?\r\n\r\nAs new features roll out, pricing may evolve.  \r\nAny changes will be communicated clearly and will never affect your current plan without your approval."}