{"slug":"tCredex_Intake_Form","metadata":{"title":"tCredex Intake Form Quick Start Guide","description":"Beginner-friendly guide to completing the tCredex intake form","image":"/images/Tax Credit Images/nmtc-financing-structure-overview-l.jpg"},"content":"# tCredex Intake Form — Quick Start Guide (Beginner Friendly Edition)\nWelcome to tCredex\nThe Intake Form is your first step to getting your project in front of Community Development Entities (CDEs), investors, and partners.\nThink of it as your project passport — once completed, it unlocks your DealCard, Marketplace listing, and automated matching.\nYou don’t need to be a tax credit expert.\nYou don’t need every document ready.\nYou just need to start.\nHow to Begin\n\n1. Go to the Intake Form\n   Visit tcredex.com/intake or click Submit Project from your dashboard.\n2. Your Progress Saves Automatically\n   You can leave anytime and return later. No accounts, no drafts, no stress.\n3. Complete Sections in Any Order\n   Jump around freely. Fill out what you know now and return to the rest later.\n4. Preview Your DealCard Anytime\n   See how your project will appear on the Marketplace before you publish.\n   Your Completion Tier (What You Unlock)\n   As you fill out the form, your completion percentage increases.\n   Each tier unlocks new visibility and matching capabilities.\n\nMost users aim for Tier 1 first — it gets your project in front of CDEs quickly.\nWhat You’ll Fill Out (The 17 Sections)\nYou only need the fields marked with an asterisk (\\*) to get listed.\n\n1. Project Information\\*\n2. Location & Census Tract\\*\n3. Tax Credit Programs\\*\n4. Project Timeline\n5. QALICB Eligibility Tests\n6. Sponsor Information\\*\n7. Development Team\n8. Total Project Cost\\*\n9. Uses of Funds\n10. Financing Gap\\*\n11. Community Impact\n12. Job Creation\n13. Environmental Status\n14. Readiness Checklist\n15. State Tax Credits (auto-filled)\n16. Document Uploads\n    Tip: If you’re unsure where to start, complete the starred items first.\n    Helpful Built In Features\n    Auto Census Tract Lookup\n    Type your address — we automatically pull the census tract and eligibility.\n    QALICB Test Wizard\n    Nine simple pass/fail checks to help you confirm NMTC eligibility.\n    State Credit Matcher\n    Based on your location, we show which state programs you may qualify for.\n    Real-Time Validation\n    If something looks off (e.g., ineligible tract, unusual financing gap), you’ll see a warning.\n    DealCard Preview\n    See exactly what your listing will look like before you publish.\n    Document Uploads\n    Drag and drop Phase I, site plans, financials, and more — we auto-tag them for you.\n    Pro Tips for a Smooth Submission\n\nWhat Happens After You Submit\nYour project moves through a simple, predictable pipeline:\n\n1. Submit the Intake Form\n2. DealCard is generated\n3. Your project is listed on the Marketplace\n4. AutoMatch AI finds compatible CDEs\n5. You receive match notifications\n6. Enter the Closing Room for due diligence and next steps\n   Need Help?\n   We’re here for you.\n   Email support@tcredex.com\n   tCredex.com The AI Powered Tax Credit Marketplace\n   © 2025 American Impact Ventures. All rights reserved."}