{"slug":"what-is-tcredex","metadata":{"title":"What is tCredex?","updatedAt":"2025-01-19","summary":"A simple overview of the tCredex platform and how it helps developers, nonprofits, and investors navigate tax credit financing.","image":"/images/Tax Credit Images/The Data Driven Developer.jpg"},"content":"## Overview\r\n\r\ntCredex is the AI-powered marketplace for tax credit financing.  \r\nIt connects developers, nonprofits, CDEs, investors, and credit buyers through a streamlined platform designed to make complex transactions faster, clearer, and more accessible.\r\n\r\nWhether you're working on a community facility, housing development, historic rehab, or mixed-use project, tCredex helps you understand your eligibility, structure your deal, and connect with the right partners.\r\n\r\n---\r\n\r\n## Why tCredex Exists\r\n\r\nTax credit financing is powerful but notoriously complex.  \r\nDevelopers often struggle with:\r\n\r\n- Understanding program eligibility\r\n- Finding the right CDE or investor\r\n- Navigating compliance requirements\r\n- Managing documents and due diligence\r\n- Coordinating multiple stakeholders\r\n\r\ntCredex was built to solve these challenges by providing a single, unified system for the entire process.\r\n\r\n---\r\n\r\n## Key Features\r\n\r\n### **Project Intake Form**\r\n\r\nA guided workflow that helps you enter your project details, determine eligibility, and generate your DealCard.\r\n\r\n### **DealCard**\r\n\r\nA clean, standardized project profile that CDEs and investors can quickly evaluate.\r\n\r\n### **AutoMatch**\r\n\r\nAI-driven matching that identifies the best partners based on:\r\n\r\n- Census tract\r\n- Program eligibility\r\n- Project type\r\n- Financing needs\r\n- Community impact\r\n\r\n### **Marketplace**\r\n\r\nA transparent space where projects and capital providers can discover each other.\r\n\r\n### **Closing Room**\r\n\r\nA secure workspace for due diligence, document sharing, and deal coordination.\r\n\r\n---\r\n\r\n## Who Uses tCredex?\r\n\r\ntCredex is designed for:\r\n\r\n- **Developers**\r\n- **Nonprofits**\r\n- **Community organizations**\r\n- **CDEs**\r\n- **Tax credit investors**\r\n- \\*\\*Credit buyers"}